---
type: FormattedText
namespace: Autodesk.Revit.DB
version: 2024
members: 36
tags: [revit-api, class]
---

# FormattedText

`Autodesk.Revit.DB.FormattedText` · Revit 2024 · 36 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FormattedText | — | `` |
| Constructor | FormattedText | 2017 | `public FormattedText ()` |
| Method | AsTextRange | 2017 | `public TextRange AsTextRange ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Find | 2017 | `public TextRange Find ( string searchString , int startIndex , bool matchCase , bool matchWholeWord )` |
| Method | GetAllCapsStatus | — | `` |
| Method | GetAllCapsStatus | 2017 | `public FormatStatus GetAllCapsStatus ()` |
| Method | GetBoldStatus | — | `` |
| Method | GetBoldStatus | 2017 | `public FormatStatus GetBoldStatus ()` |
| Method | GetIndentLevel | 2017 | `public int GetIndentLevel ( TextRange textRange )` |
| Method | GetItalicStatus | — | `` |
| Method | GetItalicStatus | 2017 | `public FormatStatus GetItalicStatus ()` |
| Method | GetListStartNumber | 2017 | `public int GetListStartNumber ( TextRange textRange )` |
| Method | GetListType | 2017 | `public ListType GetListType ( TextRange textRange )` |
| Method | GetMaximumIndentLevel | 2017 | `public int GetMaximumIndentLevel ()` |
| Method | GetMaximumListStartNumber | 2017 | `public int GetMaximumListStartNumber ()` |
| Method | GetMinimumListStartNumber | 2017 | `public int GetMinimumListStartNumber ()` |
| Method | GetPlainText | — | `` |
| Method | GetPlainText | 2017 | `public string GetPlainText ()` |
| Method | GetSubscriptStatus | — | `` |
| Method | GetSubscriptStatus | 2017 | `public FormatStatus GetSubscriptStatus ()` |
| Method | GetSuperscriptStatus | — | `` |
| Method | GetSuperscriptStatus | 2017 | `public FormatStatus GetSuperscriptStatus ()` |
| Method | GetUnderlineStatus | — | `` |
| Method | GetUnderlineStatus | 2017 | `public FormatStatus GetUnderlineStatus ()` |
| Method | SetAllCapsStatus | — | `` |
| Method | SetBoldStatus | — | `` |
| Method | SetIndentLevel | 2017 | `public void SetIndentLevel ( TextRange textRange , int level )` |
| Method | SetItalicStatus | — | `` |
| Method | SetListStartNumber | 2017 | `public void SetListStartNumber ( TextRange textRange , int value )` |
| Method | SetListType | 2017 | `public void SetListType ( TextRange textRange , ListType listType )` |
| Method | SetPlainText | — | `` |
| Method | SetSubscriptStatus | — | `` |
| Method | SetSuperscriptStatus | — | `` |
| Method | SetUnderlineStatus | — | `` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |